app/controllers/events_controller.rb

  def index
    @events = Event.order('created_at DESC')
---
SELECT "events".* FROM "events"  ORDER BY created_at DESC

  def create
    @event = Event.new(event_params)
    if @event.save
---
INSERT INTO "events" ("title", "location", "description", "date", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "latitude", "longitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "events" SET "location" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["location", "60605"], ["latitude", 41.8703314], ["longitude", -87.62357420000001], ["updated_at", "2016-06-01 02:12:03.062578"], ["id", 358]]

  def load_activities
    @activities = PublicActivity::Activity.order('created_at DESC').limit(20)
---
SELECT  "activities".* FROM "activities"  ORDER BY created_at DESC LIMIT 20