app/controllers/pages_controller.rb

SELECT  "events".* FROM "events"  ORDER BY "events"."id" DESC LIMIT 1
---
  def index
  	@event = Event.last